* flute-bore-visualizer
Clojure code to assist in comparing bores and tone holes in baroque flutes

- Models of extant baroque flutes
- Database
** Why?
The baroque flute represents the greatest sophistication of the simple flute, and if built and played well can give 3+ fully chromatic octaves. However the subtlties of the creation of the bore to do this are no longer (if ever?) fully understood. Because of this modern reproductions are largely made as perfect copies of extant flutes, engineered to 0.01mm tolerances.
I want to know why one particular flute plays so well in the 3rd octave, and can I achieve that in a flute modelled on another historical example that has a better tone but is only good in the first two octaves. 
To do this we need a tool that can effectively compare the bore differences quickly and easily even though the 2 flutes in question are in different pitches.
We also plan to use the data collected here to create models that can be used with CFD software to actually see the differences in the flow of air through different flutes at different pitches.

A minimal set of measurements of the bore would look like this. Normally there would be more pairs of points.
|----------+---------------|
| from cap | bore diameter |
|----------+---------------|
|        0 |            19 |
|      210 |            19 |
|      410 |            14 |
|      530 |            12 |
|      600 |          12.5 |
|----------+---------------|

More details for a model:
|----------+---------------+--------+----------------+--------|
| from cap | bore diameter | radius | outer diameter | radius |
|----------+---------------+--------+----------------+--------|
|        0 |            19 |    9.5 |             26 |     13 |
|      210 |            19 |    9.5 |             27 |   13.5 |
|      410 |            14 |      7 |             24 |     12 |
|      530 |            12 |      6 |             23 |   11.5 |
|      600 |          12.5 |   6.25 |             20 |     10 |
|----------+---------------+--------+----------------+--------|
#+TBLFM: $5=$4/2
#+TBLFM: $3=$2/2

** Rudall and Carte
The Head Section is lined with a brass tube that is *18.95mm* ID and *199.5mm* long. The reason the *Length* measurements of the lowest 2 sections don't start at 0 is that the measurements begin from the bottom of the circular mortice where the sections are assembled.
*** Left Hand Section
|----------+--------+--------|
| Diameter | Length | Radius |
|----------+--------+--------|
|     18.9 |      0 |   9.45 |
|     18.8 |      3 |    9.4 |
|     18.7 |      4 |   9.35 |
|     18.6 |      6 |    9.3 |
|     18.5 |      8 |   9.25 |
|     18.4 |     11 |    9.2 |
|     18.3 |     13 |   9.15 |
|     18.2 |     17 |    9.1 |
|     18.1 |     29 |   9.05 |
|     18.0 |     35 |     9. |
|     17.9 |     42 |   8.95 |
|     17.8 |     47 |    8.9 |
|     17.7 |     51 |   8.85 |
|     17.6 |     60 |    8.8 |
|     17.5 |     65 |   8.75 |
|     17.4 |     72 |    8.7 |
|     17.3 |     79 |   8.65 |
|     17.2 |     84 |    8.6 |
|     17.1 |     96 |   8.55 |
|     17.0 |    102 |    8.5 |
|     16.9 |    107 |   8.45 |
|     16.8 |    112 |    8.4 |
|     16.7 |    117 |   8.35 |
|     16.6 |    123 |    8.3 |
|     16.5 |    130 |   8.25 |
|     16.4 |    139 |    8.2 |
|     16.3 |    145 |   8.15 |
|     16.2 |    151 |    8.1 |
|     16.1 |    155 |   8.05 |
|     16.0 |    161 |     8. |
|     15.9 |    165 |   7.95 |
|     15.8 |    173 |    7.9 |
|     15.7 |    177 |   7.85 |
|     15.6 |    183 |    7.8 |
|     15.5 |    187 |   7.75 |
|     15.4 |    188 |    7.7 |
|     15.3 |    193 |   7.65 |
|     15.2 |    200 |    7.6 |
|     15.3 |    205 |   7.65 |
|     15.4 |    207 |    7.7 |
|     15.5 |    209 |   7.75 |
|----------+--------+--------|
#+TBLFM: $3=$1/2
*** Right Hand Section
|----------+--------+--------|
| Diameter | Length | Radius |
|----------+--------+--------|
|       15 |     21 |    7.5 |
|     14.9 |     23 |   7.45 |
|     14.8 |     28 |    7.4 |
|     14.7 |     33 |   7.35 |
|     14.6 |     38 |    7.3 |
|     14.5 |     43 |   7.25 |
|     14.4 |     45 |    7.2 |
|     14.3 |     50 |   7.15 |
|     14.2 |     55 |    7.1 |
|     14.1 |     59 |   7.05 |
|     14.0 |     63 |     7. |
|     13.9 |     70 |   6.95 |
|     13.8 |     74 |    6.9 |
|     13.7 |     78 |   6.85 |
|     13.6 |     87 |    6.8 |
|     13.5 |     92 |   6.75 |
|     13.4 |     97 |    6.7 |
|     13.3 |    105 |   6.65 |
|     13.2 |    110 |    6.6 |
|     13.1 |    114 |   6.55 |
|     13.2 |    125 |    6.6 |
|     13.3 |    128 |   6.65 |
|     13.4 |    131 |    6.7 |
|----------+--------+--------|
#+TBLFM: $3=$1/2
*** Foot Section
|----------+--------+--------|
| Diameter | Length | Radius |
|----------+--------+--------|
|       13 |     22 |    6.5 |
|     12.9 |     23 |   6.45 |
|     12.8 |     25 |    6.4 |
|     12.7 |     27 |   6.35 |
|     12.6 |     32 |    6.3 |
|     12.5 |     34 |   6.25 |
|     12.4 |     36 |    6.2 |
|     12.3 |     43 |   6.15 |
|     12.2 |     47 |    6.1 |
|     12.1 |     52 |   6.05 |
|     12.0 |     56 |     6. |
|     11.9 |     64 |   5.95 |
|     11.8 |     67 |    5.9 |
|     11.7 |     71 |   5.85 |
|     11.6 |     77 |    5.8 |
|     11.5 |     84 |   5.75 |
|     11.4 |     87 |    5.7 |
|     11.3 |     95 |   5.65 |
|     11.2 |    105 |    5.6 |
|     11.1 |    107 |   5.55 |
|     11.0 |    114 |    5.5 |
|     10.9 |    115 |   5.45 |
|     10.8 |    122 |    5.4 |
|     10.8 |    128 |    5.4 |
|     10.8 |    130 |    5.4 |
|----------+--------+--------|
#+TBLFM: $3=$1/2
